tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision calculator
brew "calc"
# Cross-platform make
brew "cmake"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# postgres database
brew "postgresql@15"
# move .dotfiles
brew "stow"
# psql
brew "libpq"
# 'go to definition' feature
brew "ctags"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution with GUI applications
cask "mactex"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
